# Grouping

We will use the Palmer penguins dataset

In [2]:
import pandas as pd

#read in penguins dataset form URL
penguins = pd.read_csv("https://raw.githubusercontent.com/allisonhorst/palmerpenguins/main/inst/extdata/penguins.csv")

penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

# Summary Statistics

In `pandas` it is easy to get summary statistics for each column in a dataframe

**Example**

In [4]:
# get the number of non-NA values in each column 
penguins.count()

species              344
island               344
bill_length_mm       342
bill_depth_mm        342
flipper_length_mm    342
body_mass_g          342
sex                  333
year                 344
dtype: int64

In [5]:
#get the minimum value in each numeric column
penguins.select_dtypes('number').min()

bill_length_mm         32.1
bill_depth_mm          13.1
flipper_length_mm     172.0
body_mass_g          2700.0
year                 2007.0
dtype: float64

## Grouping

Our penguins data can be naturally split (islands, sex, species, year).
Often we want to calculate summary statistics for these groups.
How do we do this?

### Example:
q: calculate the average flipper length per species
*How do we do this by hand?

1. We start with our data and notice there are multiple species in the `species` column
2. split our original table to group all observations from the same species together.
3. We calculate the average flipper length for each of the groups we formed.
4. Then we combine the values for average flipper length per species into a single table.

This is called the **Split-Apply-Combine strategy**.

*How do we do this in code?*
We use `groupby()`. General syntax:
```
df.groupby(columns_to_group_by)
```
where(most often) `column_to_group_by` = a single column name (string) or a list of column names. The unique values of the column (or columns) will be used as the groups of the data frames.

**Example**

Calculate mean flipper length by species/

First, find the method that calculates the mean: `mean()`

In [6]:
#this is the average of the whole flipper length column
penguins.flipper_length_mm.mean()

200.91520467836258

To get the mean flipper length:
1. group dataset by species, 
2. select column
3. apply mean function

In [7]:
penguins.groupby('species')

In [9]:
#mean is after groupby species
penguins.groupby('species').mean().flipper_length_mm

species
Adelie       189.953642
Chinstrap    195.823529
Gentoo       217.186992
Name: flipper_length_mm, dtype: float64

In [11]:
#mean is after flipper length
penguins.groupby('species').flipper_length_mm.mean()

#all will get us the same results

species
Adelie       189.953642
Chinstrap    195.823529
Gentoo       217.186992
Name: flipper_length_mm, dtype: float64

We can also group by combinations of columns.

**Example**

Suppose we want to know what was the number of penguins in every island on different years.
We can use the `count()` method to count the number of non-NA values in each column like this:

In [12]:
penguins.count()

species              344
island               344
bill_length_mm       342
bill_depth_mm        342
flipper_length_mm    342
body_mass_g          342
sex                  333
year                 344
dtype: int64

When we group by island and year we get the count of non-NA values for each column divided for each combination of island and year:

In [16]:
#if you run this, nothing will happen
#penguins.groupby(['island', 'year'])

#you need to run this for the count to show up
penguins.groupby(['island', 'year']).count()

                species  bill_length_mm  bill_depth_mm  flipper_length_mm  \
island    year
Biscoe    2007       44              44             44                 44
          2008       64              64             64                 64
          2009       60              59             59                 59
Dream     2007       46              46             46                 46
          2008       34              34             34                 34
          2009       44              44             44                 44
Torgersen 2007       20              19             19                 19
          2008       16              16             16                 16
          2009       16              16             16                 16

                body_mass_g  sex
island    year
Biscoe    2007           44   43
          2008           64   63
          2009           59   57
Dream     2007           46   45
          2008           34   34
          2009           44   44
Torgersen 2007           19   15
          2008           16   16
          2009           16   16

Let’s say we want to plot the surveyed population per year and island. 

We could then use a “one liner” to do it in this way:

In [17]:
#We want just the species column
penguins.groupby(['island', 'year']).count().species.sort

                species  bill_length_mm  bill_depth_mm  flipper_length_mm  \
island    year
Biscoe    2007       44              44             44                 44
          2008       64              64             64                 64
          2009       60              59             59                 59
Dream     2007       46              46             46                 46
          2008       34              34             34                 34
          2009       44              44             44                 44
Torgersen 2007       20              19             19                 19
          2008       16              16             16                 16
          2009       16              16             16                 16

                body_mass_g  sex
island    year
Biscoe    2007           44   43
          2008           64   63
          2009           59   57
Dream     2007           46   45
          2008           34   34
          2009           44   44
Torgersen 2007           19   15
          2008           16   16
          2009           16   16